RT-Thread/rt-thread/bsp/stm32f107/drivers/msd.c
	if (status == MSD_RESPONSE_NO_ERROR) return size;

	rt_kprintf("read failed: %d\n", status);
	return 0;
}

static rt_size_t rt_msd_write (rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
	rt_uint8_t status;
	rt_uint32_t i;

	status = MSD_RESPONSE_NO_ERROR;
	// rt_kprintf("write: 0x%x, size %d\n", pos, size);

	/* write all sectors */
	for (i = 0; i < size; i ++)
	{
		status = MSD_WriteBuffer((rt_uint8_t*)((rt_uint8_t*)buffer + i * SECTOR_SIZE),
			(part.offset + pos + i)* SECTOR_SIZE, SECTOR_SIZE);
		if (status != MSD_RESPONSE_NO_ERROR)
		{
			rt_kprintf("sd card write failed\n");
			return 0;
		}
	}

	if (status == MSD_RESPONSE_NO_ERROR) return size;

	rt_kprintf("write failed: %d\n", status);
	return 0;
}

static rt_err_t rt_msd_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
    RT_ASSERT(dev != RT_NULL);

	return RT_EOK;
}

void rt_hw_msd_init()
{
	if (MSD_Init() == MSD_RESPONSE_NO_ERROR)
	{
		rt_uint8_t status;
		rt_uint8_t *sector;

		/* register sdcard device */
		sdcard_device.init 	= rt_msd_init;
		sdcard_device.open 	= rt_msd_open;
		sdcard_device.close = rt_msd_close;
		sdcard_device.read 	= rt_msd_read;
		sdcard_device.write = rt_msd_write;
		sdcard_device.control = rt_msd_control;

		/* no private */
		sdcard_device.user_data = RT_NULL;
		/* get the first sector to read partition table */
		sector = (rt_uint8_t*) rt_malloc (512);
		if (sector == RT_NULL)
		{
			rt_kprintf("allocate partition sector buffer failed\n");
			return;
		}

		status = MSD_ReadBlock(sector, 0, 512);
		if (status == MSD_RESPONSE_NO_ERROR)
		{
			/* get the first partition */
			status = dfs_filesystem_get_partition(&part, sector, 0);
			if (status != RT_EOK)
			{
				/* there is no partition table */
				part.offset = 0;
				part.size   = 0;
			}
		}
		else
		{
			/* there is no partition table */
			part.offset = 0;
			part.size   = 0;
		}

		/* release sector buffer */
		rt_free(sector);

		rt_device_register(&sdcard_device, "sd0",
			RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_REMOVABLE | RT_DEVICE_FLAG_STANDALONE);
	}
	else
	{
		rt_kprintf("sdcard init failed\n");
	}
}
